In [2]:
pip install cx_Oracle

Collecting cx_Oracle
  Downloading cx_Oracle-8.3.0-cp310-cp310-win_amd64.whl (213 kB)
     ---------------------------------------- 0.0/213.1 kB ? eta -:--:--
     - -------------------------------------- 10.2/213.1 kB ? eta -:--:--
     ------------------------------------ - 204.8/213.1 kB 3.1 MB/s eta 0:00:01
     -------------------------------------- 213.1/213.1 kB 2.6 MB/s eta 0:00:00
Installing collected packages: cx_Oracle
Successfully installed cx_Oracle-8.3.0
Note: you may need to restart the kernel to use updated packages.

In [1]:
# 데이터프레임으로 불러오기
import cx_Oracle
import pandas as pd
con = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cur = con.cursor()
cur.execute('select * from EMPLOYEES')
res = cur.fetchall()
df = pd.DataFrame(res)
cur.execute("select column_name from user_tab_columns where table_name='EMPLOYEES'")
col = cur.fetchall()
li = []
for i in col:
    for j in i:
        li.append(j)
df.columns = li
print(df.head())
cur.close()
con.close()

   EMPLOYEE_ID FIRST_NAME  LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE  \
0          198     Donald   OConnell  DOCONNEL  650.507.9833 2007-06-21
1          199    Douglas      Grant    DGRANT  650.507.9844 2008-01-13
2          200   Jennifer     Whalen   JWHALEN  515.123.4444 2003-09-17
3          201    Michael  Hartstein  MHARTSTE  515.123.5555 2004-02-17
4          202        Pat        Fay      PFAY  603.123.6666 2005-08-17

     JOB_ID   SALARY  COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
0  SH_CLERK   2600.0             NaN       124.0           50.0
1  SH_CLERK   2600.0             NaN       124.0           50.0
2   AD_ASST   4400.0             NaN       101.0           10.0
3    MK_MAN  13000.0             NaN       100.0           20.0
4    MK_REP   6000.0             NaN       201.0           20.0

In [3]:
# create
import cx_Oracle
conn = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cs = conn.cursor()
sql = "create table sample3(id varchar2(10), score number)"
cs.execute(sql)
cs.close()
conn.commit()
conn.close()

In [4]:
# insert
conn = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cs = conn.cursor()
sql = "insert into sample3 (id, score) values (1, 100)"
cs.execute(sql)
cs.close()
conn.commit()
conn.close()

In [5]:
# update

con = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cs = con.cursor()
sql = "update SAMPLE3 set id='1' where score=200"
cs.execute(sql)
cs.close()
con.commit()
con.close()

In [6]:
# delete

con = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cs = con.cursor()
sql = " delete from sample3 where score=1"
cs.execute(sql)
cs.close()
con.commit()
con.close()

In [7]:
con = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cur = con.cursor()
cur.execute('select * from SAMPLE3')
res = cur.fetchall()
df = pd.DataFrame(res)
cur.execute("select column_name from user_tab_columns where table_name='SAMPLE3'")
col = cur.fetchall()

li = []
for i in col:
    for j in i:
        li.append(j)
df.columns = li
print(df.head())
cur.close()
con.close()

  ID  SCORE
0  1    100

In [8]:
# create
import cx_Oracle
conn = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cs = conn.cursor()
sql = "create table sample4(id varchar2(10), score varchar2(10), quantity varchar2(10))"
cs.execute(sql)
cs.close()
conn.commit()
conn.close()

In [9]:
# executemany
import cx_Oracle
import pandas as pd
con = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cur = con.cursor()

rows = [ ('1','3','3' ), ('9','3','3'),
         ('2','3','3' ), ('7','3','3' ),
         ('4','3','3' ), ('8','3','3' ),
         ('5','3','3' ) ]

cur.executemany("insert into sample4(id,score,quantity) values (:1,:2,:3)", rows)
print(cur.rowcount)

cur.close()
con.commit()
con.close()

7

In [12]:
# 컬럼 가져오기
import cx_Oracle
import pandas as pd
con = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cursor = con.cursor()
cursor.execute("select * from sample4")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("select column_name from user_tab_columns where table_name='SAMPLE4'")
col = cursor.fetchall()
list_py = []
for i in col:
    for j in i:
        list_py.append(j)
df.columns = list_py
df.head()

  ID SCORE QUANTITY
0  1     3        3
1  9     3        3
2  2     3        3
3  7     3        3
4  4     3        3

In [20]:
!mkdir dataset

In [13]:
# csv 데이터 처리
df.to_csv('./dataset/c4.csv')

In [14]:
df = pd.read_csv('./dataset/c4.csv',index_col=0)
df

   ID  SCORE  QUANTITY
0   1      3         3
1   9      3         3
2   2      3         3
3   7      3         3
4   4      3         3
5   8      3         3
6   5      3         3

In [18]:
# 대량 데이터 입력
import numpy as np
import pandas as pd

df = pd.DataFrame()
df['id'] = np.arange(10000)
df['sales'] = np.random.randint(1,100,size=10000)
df.head()

NameError: name 'teil' is not defined

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10000 non-null  int32
 1   sales   10000 non-null  int32
dtypes: int32(2)
memory usage: 78.2 KB

In [29]:
df['id'] = df.id.astype('str')

In [30]:
ar = df.values
# tu = tuple(map(tuple,ar))
results = list([tuple(e) for e in ar])
results[:10]

[('0', 37),
 ('1', 95),
 ('2', 84),
 ('3', 34),
 ('4', 50),
 ('5', 34),
 ('6', 33),
 ('7', 50),
 ('8', 29),
 ('9', 7)]

In [32]:
# create
import cx_Oracle
conn = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cs = conn.cursor()
sql = "create table sample2(id varchar2(10), sales number)"
cs.execute(sql)
cs.close()
conn.commit()
conn.close()

In [34]:
con = cx_Oracle.connect("c##KITA","KITA","localhost:1521/xe")
cursor = con.cursor()
sql = "insert into sample2 (id,sales) values (:1, :2)"
data = []
for r in results:
    data.append((r[0], r[1]))
cursor.executemany(sql, data)
cursor.close()
con.commit()
con.close()